{
    "sample_rows": [],
    "table_name": "CYBERSYN.INTERNATIONAL_TRADE_ADMINISTRATION_EXPORT_SCREENED_ENTITIES_INDEX",
    "table_fullname": "GLOBAL_GOVERNMENT.CYBERSYN.INTERNATIONAL_TRADE_ADMINISTRATION_EXPORT_SCREENED_ENTITIES_INDEX",
    "column_names": [
        "CITIZENSHIPS",
        "END_DATE",
        "SOURCE_INFORMATION_URL",
        "ADDRESSES",
        "SOURCE",
        "EXPORT_RESTRICTED_ENTITY_TYPE",
        "DATES_OF_BIRTH",
        "VESSEL_GROSS_TONNAGE",
        "FEDERAL_REGISTER_NOTICE",
        "PROGRAMS",
        "COMMENTS",
        "VESSEL_CALL_SIGN",
        "EXPORT_RESTRICTED_ENTITY_NUMBER",
        "GEO_ID_COUNTRY",
        "ALT_NAMES",
        "START_DATE",
        "NATIONALITIES",
        "SOURCE_LIST_URL",
        "EXPORT_RESTRICTED_ENTITY_NAME",
        "VESSEL_GROSS_REGISTERED_TONNAGE",
        "EXPORT_RESTRICTED_ENTITY_TITLE",
        "IDS",
        "EXPORT_RESTRICTED_ENTITY_ID",
        "PLACES_OF_BIRTH",
        "STANDARD_ORDER"
    ],
    "column_types": [
        "ARRAY",
        "DATE",
        "TEXT",
        "ARRAY",
        "TEXT",
        "TEXT",
        "ARRAY",
        "TEXT",
        "TEXT",
        "ARRAY",
        "TEXT",
        "TEXT",
        "NUMBER",
        "TEXT",
        "ARRAY",
        "DATE",
        "ARRAY",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "ARRAY",
        "TEXT",
        "ARRAY",
        "TEXT"
    ],
    "description": [
        "Citizenships of the listed individual.",
        "The date when the listing will no longer be valid.",
        "URL for the source.",
        "The physical addresses associated with the entity.",
        "Name of the source that identified and monitors this company, entity, or person.",
        "The type of entity that is listed (e.g., Vessel, Individual, Entity, Aircraft).",
        "Birth dates of the listed individual(s), if available.",
        "A more modern measurement of a ship's size that is calculated based on the volume of all enclosed spaces of a ship.",
        "The Federal Register citation indicating the law or policy under which the entity is listed.",
        "Specific sanction or restriction program under which the individual, entity, or vessel is listed.",
        "Associated comments from the organization on the entity.",
        "The unique call sign assigned to a vessel for identification purposes, similar to a license plate number on a vehicle.",
        "Unique identifier for the entity.",
        "Unique geographic identifier for the country associated with the listing.",
        "Any known alternate names for the entity.",
        "The date when the listing came into effect.",
        "Nationality of the listed individual or entity's country of formation.",
        "URL for the source list or further information about the entry.",
        "The name of the individual, group, vessel, or entity on the list (e.g., Khokhlova, Olga Nikolayevna).",
        "A measure of the overall internal volume of a vessel, with one gross registered tonnage unit representing 100 cubic feet of space.",
        "The title for an individual, group, vessel, or entity on the list (e.g., Member of the Federation Council of the Federal Assembly of the Russian Federation).",
        "Associated IDs with an individual or group (e.g., passport details).",
        "Unique identifier provided by the International Trade Administration (ITA) for the entity listed with a prefix associated with the source.",
        "Place of birth of the listed individual(s), if available.",
        "A general directive applied to transactions with the listed entity."
    ]
}