{
    "sample_rows": [
        {
            "CONTRACT_AWARD_ID": "N0017804D4077-FD02-35",
            "CONTRACT_SOLICITATION_ID": "N0002408R3291",
            "AWARD_NAME": "RECOVERY--R--PROJECT NUMBER 4201S, RECOVERY--R--PROJECT NUMBER 4201S , DDG-51 HYBRID ELECTRIC DRIVE",
            "AWARD_DESCRIPTION": "Incremental Funding in the amount of $46,000 for Engineering Services in support of surface ship program under contract N000178-04-D-4077/FD02 RECOVERY â\u0080\u0093 PER FAR 5.7 This notice is provided for information purposes only. Therefore, FAR 5.203 does not apply. This opportunity is available only under N00178-04-D-4077-FD02 to support Navys SeaPort-e. This contract action was not awarded as a fixed price contract type. Uncertainties involved in contract performance did not permit costs estimated with sufficient accuracy to use any type of fixed price contract. A cost reimbursement type contract was awarded (FAR 16.301-2). The funding of $40,000 is to integrate an electric motor onto the propulsion plant of the DDG 51 Class of destroyers. The goal of this project is to demonstrate that as much as 250 gallons of fuel per hour can be saved by altering the DDG propulsion and electric plant configuration at lower speeds. Currently, large propulsion gas turbines are run at low power where they are very inefficient when required ship speed is low. By adding an electric motor to the propulsion plant, the large propulsion gas turbine can be turned off, the electric plant gas turbines can be placed in a higher more fuel efficient operating range, and can save significant amounts of fuel. The specific task, Technical Instruction 150, modifies the propulsion and electric plant operator interface to give the sailor control of and status back from this new motor.",
            "AWARD_AMOUNT": 40000.0,
            "AWARD_DATE": "2010-09-28",
            "RECIPIENT": "Life Cycle Engineering, Inc. 4360 Corporate Road, Suite 100 North Charleston, Sc 29405",
            "PRIMARY_AWARDER_CONTACT_ID": null,
            "PRIMARY_AWARDER_CONTACT_NAME": null,
            "PRIMARY_AWARDER_CONTACT_TITLE": null,
            "PRIMARY_AWARDER_CONTACT_EMAIL": null,
            "PRIMARY_AWARDER_CONTACT_PHONE": null,
            "PRIMARY_AWARDER_CONTACT_FAX": null
        },
        {
            "CONTRACT_AWARD_ID": "W912EE20P0067",
            "CONTRACT_SOLICITATION_ID": "W912EE20P0067",
            "AWARD_NAME": "CAPE RETREAT STAIRS SUPPLY INSTALL",
            "AWARD_DESCRIPTION": " ",
            "AWARD_AMOUNT": 41785.0,
            "AWARD_DATE": "2020-09-14",
            "RECIPIENT": "Gulf Coast Ez Dock And Lift, Llc Walker La Usa",
            "PRIMARY_AWARDER_CONTACT_ID": null,
            "PRIMARY_AWARDER_CONTACT_NAME": null,
            "PRIMARY_AWARDER_CONTACT_TITLE": null,
            "PRIMARY_AWARDER_CONTACT_EMAIL": null,
            "PRIMARY_AWARDER_CONTACT_PHONE": null,
            "PRIMARY_AWARDER_CONTACT_FAX": null
        },
        {
            "CONTRACT_AWARD_ID": "HQ0034-09-D-3007",
            "CONTRACT_SOLICITATION_ID": "HQ0034-ONA-09-BAA-0002",
            "AWARD_NAME": "Research and Studies for ONA",
            "AWARD_DESCRIPTION": " This publication constitutes a \"Notice of Contract Award\" to Center for Strategic and Budgetary Assessments (CSBA), in response to Broad Agency Announcement (BAA) HQ0034-ONA-09-BAA-0002 (1), entitled \"Research and Studies for the Office of Network Assessment, \"posted 30 Jan 09, in accordance with (IAW) Federal Acquisition Regulation (FAR) 6.102(d)(2). The BAA was issued by Washington Headquarters Services, Acquisition and Procurement Office (WHS/A&PO) on behalf of the Office of Net Assessment, Office of the Secretary of Defense. The community of interest for this BAA is the Office of Net Assessment, Office of the Secretary of Defense. Complementary to the BAA, the Office of Network Assessment, and the Office of the Secretary of Defense, CSBA shall conduct Research and Studies in various areas in accordance with the BAA. The award is for a base year and four one-year option periods, Firm-Fixed-Price type contract, should the Government elect to exercise any of its options. IAW the BAA language therein, the Government reserved the right to select for award all, some, or none of the proposals in response to the announcement. This award to CSBA is based on a Full and Open Competition award process and entailed Fair Opportunity to all respondents.",
            "AWARD_AMOUNT": 7000000.0,
            "AWARD_DATE": "2009-09-14",
            "RECIPIENT": "Center For Strategic And Budfetary Assessments 1667 K Street, Nw Washington Dc 20006 Usa",
            "PRIMARY_AWARDER_CONTACT_ID": "a9a58b8508137a113a4a087d00e0482d",
            "PRIMARY_AWARDER_CONTACT_NAME": "Karen Rooney",
            "PRIMARY_AWARDER_CONTACT_TITLE": "Contracting Officer",
            "PRIMARY_AWARDER_CONTACT_EMAIL": "karen.rooney@whs.mil",
            "PRIMARY_AWARDER_CONTACT_PHONE": "7035881922",
            "PRIMARY_AWARDER_CONTACT_FAX": "7035881990"
        },
        {
            "CONTRACT_AWARD_ID": "DE-AC65-08WG78352",
            "CONTRACT_SOLICITATION_ID": "DE-RP65-08WG78352",
            "AWARD_NAME": "Y--Empire Substation, Stage 01",
            "AWARD_DESCRIPTION": null,
            "AWARD_AMOUNT": 2036711.0,
            "AWARD_DATE": "2008-09-26",
            "RECIPIENT": "Addison Construction Company",
            "PRIMARY_AWARDER_CONTACT_ID": null,
            "PRIMARY_AWARDER_CONTACT_NAME": null,
            "PRIMARY_AWARDER_CONTACT_TITLE": null,
            "PRIMARY_AWARDER_CONTACT_EMAIL": null,
            "PRIMARY_AWARDER_CONTACT_PHONE": null,
            "PRIMARY_AWARDER_CONTACT_FAX": null
        },
        {
            "CONTRACT_AWARD_ID": "SPE8E923V2089",
            "CONTRACT_SOLICITATION_ID": "SPE8E923T2911",
            "AWARD_NAME": "34--SOLDERING-DESOLDERI",
            "AWARD_DESCRIPTION": "Proposed procurement for NSN 3439013777760 SOLDERING-DESOLDERI: Line 0001 Qty 9 UI EA Deliver To: DLA DISTRIBUTION DEPOT HILL By: 0155 DAYS ADO Line 0002 Qty 41 UI EA Deliver To: DLA DISTRIBUTION DEPOT HILL By: 0155 DAYS ADO Approved sources are 17794 8007-0203; 4JZC3 8007-0203; 79JU4 8007-0203. The solicitation is an RFQ and will be available at the link provided in this notice. Hard copies of this solicitation are not available. Specifications, plans, or drawings are not available. All responsible sources may submit a quote which, if timely received, shall be considered. Quotes must be submitted electronically. ",
            "AWARD_AMOUNT": 90546.0,
            "AWARD_DATE": "2023-07-06",
            "RECIPIENT": "Linsun Industrial Group Llc",
            "PRIMARY_AWARDER_CONTACT_ID": null,
            "PRIMARY_AWARDER_CONTACT_NAME": null,
            "PRIMARY_AWARDER_CONTACT_TITLE": null,
            "PRIMARY_AWARDER_CONTACT_EMAIL": null,
            "PRIMARY_AWARDER_CONTACT_PHONE": null,
            "PRIMARY_AWARDER_CONTACT_FAX": null
        }
    ],
    "table_name": "CYBERSYN.GOVERNMENT_CONTRACT_AWARD_INDEX",
    "table_fullname": "GLOBAL_GOVERNMENT.CYBERSYN.GOVERNMENT_CONTRACT_AWARD_INDEX",
    "column_names": [
        "AWARD_NAME",
        "AWARD_AMOUNT",
        "CONTRACT_SOLICITATION_ID",
        "PRIMARY_AWARDER_CONTACT_EMAIL",
        "AWARD_DATE",
        "RECIPIENT",
        "CONTRACT_AWARD_ID",
        "AWARD_DESCRIPTION",
        "PRIMARY_AWARDER_CONTACT_FAX",
        "PRIMARY_AWARDER_CONTACT_PHONE",
        "PRIMARY_AWARDER_CONTACT_TITLE",
        "PRIMARY_AWARDER_CONTACT_ID",
        "PRIMARY_AWARDER_CONTACT_NAME"
    ],
    "column_types": [
        "TEXT",
        "FLOAT",
        "TEXT",
        "TEXT",
        "DATE",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT"
    ],
    "description": [
        "A short summary of the goods and services in the awarded contract",
        "The total amount of the awarded contract",
        "Unique solicitation number provided by the System for Award Management (sam.gov) for a specific contract.  Joinable to the GOVERNMENT_CONTRACT_INDEX table.",
        "Email of the primary government contact at the office awarding the contract",
        "The date the contract was awarded",
        "The name and address of the organization receiving the contract",
        "Award number provided by the System for Award Management (sam.gov) that is unique to each award for a given contract.",
        "A detailed statement of work and requirements of the services or products in the awarded contract",
        "Fax number of the primary government contact at the office awarding the contract",
        "Phone number of the primary government contact at the office awarding the contract",
        "Title of the primary government contact at the office awarding the contract",
        "Unique identifier for the primary government contact awarding the contract.",
        "Name of the primary government contact at the office awarding the contract"
    ]
}