{
    "sample_rows": [
        {
            "CONTRACT_SOLICITATION_ID": "SPM4M1-07-R-0436",
            "ORIGINAL_CONTRACT_TITLE": "31 -- Bearing, Sleeve",
            "ORIGINAL_CONTRACT_DESCRIPTION": "NSN: 3120-01-212-0183, BEARING, SLEEVE, I/A/W MCDONNELL DOUGLAS CORP., CAGE 76301, DRAWING: 74A410868 AND P/N 74A410868-1001. ACCEPTABLE SOURCES(CAGE CODES): S5495, 2M490, 2U518, 32168, 35962, 6Z056, 85941, 9K006. THIS IS A CONFIGURATION CONTROL ITEM, A CRITICAL APPLICATION ITEM, AND NOT A COMMERCIAL ITEM. ORIGIN INSPECTION IS REQUIRED. SOLICITATION WILL RESULT IN AN INDEFINITE QUANTITY CONTRACT FOR A BASE YEAR PLUS FOUR OPTION YEARS. PRICING WILL BE EVALUATED ON THE ESTIMATED ANNUAL DEMAND QUANTITY FOR THE BASE AND OPTION YEARS, WHICH IS 157 EACH. SOLICITED 100% SET ASIDE FOR SERVICE DISABLED VETERAN OWNED SMALL BUSINESS ON AN OTHER THAN FULL AND OPEN COMPETITION BASIS. DELIVERY IS REQUESTED IN 60 DAYS ARO. SURGE APPLIES. A COPY OF THE SOLICITATION WILL BE AVAILABLE VIA THE DIBBS BID BOARD AT: http://www.dibbs.bsm.dla.mil ON THE ISSUE DATE CITED IN THE RFP. A PAPER COPY OF THIS SOLICITATION WILL NOT BE AVAILABLE TO REQUESTORS. THE SOLICITATION ISSUE DATE IS JUNE 29, 2007. ANTICIATED AWARD DATE IS AUGUST 30, 2007.",
            "DEPARTMENT": null,
            "AGENCY": null,
            "AGENCY_OFFICE": null,
            "FIRST_POSTED_DATE": "2007-06-14 00:00:00-04:00",
            "RESPONSE_DEADLINE": "2007-07-30 00:00:00-05:00",
            "NAICS_CODE": 332991,
            "NAICS_DESCRIPTION": "Ball and Roller Bearing Manufacturing",
            "SPECIAL_AWARD_PROVISION": "Total Small Disadvantage Business",
            "PERFORMANCE_CITY": null,
            "PERFORMANCE_STATE": null,
            "PERFORMANCE_ZIPCODE": null,
            "PERFORMANCE_COUNTRY": null,
            "PERFORMANCE_GEO_ID_CITY": null,
            "PERFORMANCE_GEO_ID_STATE": null,
            "PERFORMANCE_GEO_ID_ZIP": null,
            "PERFORMANCE_GEO_ID_COUNTRY": null
        },
        {
            "CONTRACT_SOLICITATION_ID": "RFQ.Aircraft.Wing.Spar.TL.Kit-24341",
            "ORIGINAL_CONTRACT_TITLE": "51 -- Aircraft Wing Spar Tool Kit",
            "ORIGINAL_CONTRACT_DESCRIPTION": null,
            "DEPARTMENT": null,
            "AGENCY": null,
            "AGENCY_OFFICE": null,
            "FIRST_POSTED_DATE": "2007-01-23 00:00:00-05:00",
            "RESPONSE_DEADLINE": "2007-01-30 00:00:00-05:00",
            "NAICS_CODE": 332212,
            "NAICS_DESCRIPTION": null,
            "SPECIAL_AWARD_PROVISION": null,
            "PERFORMANCE_CITY": null,
            "PERFORMANCE_STATE": null,
            "PERFORMANCE_ZIPCODE": null,
            "PERFORMANCE_COUNTRY": null,
            "PERFORMANCE_GEO_ID_CITY": null,
            "PERFORMANCE_GEO_ID_STATE": null,
            "PERFORMANCE_GEO_ID_ZIP": null,
            "PERFORMANCE_GEO_ID_COUNTRY": null
        },
        {
            "CONTRACT_SOLICITATION_ID": "N4008519R0013",
            "ORIGINAL_CONTRACT_TITLE": "F--FY19 MCAS Cherry Point Timber Harvest, MCOLF Atlantic Field",
            "ORIGINAL_CONTRACT_DESCRIPTION": "Approx. 181 acres located on MCAS Cherry Point, MCOLF Atlantic",
            "DEPARTMENT": "Dept Of Defense",
            "AGENCY": "Dept Of The Navy",
            "AGENCY_OFFICE": "Navfacsyscom Mid-Atlantic",
            "FIRST_POSTED_DATE": "2018-09-04 13:49:23-04:00",
            "RESPONSE_DEADLINE": "2018-11-01 00:00:00-05:00",
            "NAICS_CODE": 113310,
            "NAICS_DESCRIPTION": "Logging",
            "SPECIAL_AWARD_PROVISION": null,
            "PERFORMANCE_CITY": null,
            "PERFORMANCE_STATE": null,
            "PERFORMANCE_ZIPCODE": null,
            "PERFORMANCE_COUNTRY": null,
            "PERFORMANCE_GEO_ID_CITY": null,
            "PERFORMANCE_GEO_ID_STATE": null,
            "PERFORMANCE_GEO_ID_ZIP": null,
            "PERFORMANCE_GEO_ID_COUNTRY": null
        },
        {
            "CONTRACT_SOLICITATION_ID": "N6247312R0208",
            "ORIGINAL_CONTRACT_TITLE": "C--AE IDIQ Cost Engineering and Value Engineering, Unrestricted, NAVFAC SW",
            "ORIGINAL_CONTRACT_DESCRIPTION": "DESCRIPTION: This is an Unrestricted procurement. There is no solicitation to download. Architect/Engineer (A/E) services are required for a firm fixed-price Indefinite-Delivery, Indefinite-Quantity (IDIQ) contract for Cost Engineering and Value Engineering services at various Navy and Marine Corps Facilities and other Military Installations located in the NAVFAC Southwest Area of Responsibility: California, Arizona, Nevada, Colorado, New Mexico, and Utah; but may be available to the NAVFAC LANT Area of Responsibility (the Continental United States, including Alaska) as approved by the NAVFAC SW Procuring Contracting Officer. The preponderance of the work will be in California. Required services are for Cost Engineering and Value Engineering services for new construction, renovation/alteration, repair, and maintenance projects, with Architectural and Engineering support. Cost Engineering (CE) shall be in support of Studies, Surveys, Analyses, Reports, RFP's, Designs, and Change Orders. All Cost Estimates, including Value Engineering estimates, shall be prepared in the Work Breakdown Structure, Uniformat II, and CSI formats in excel spreadsheets, and/or cost estimating programs such as SUCCESS, and PACES. Units of measurement may require either Metric or English system. Cost Estimates shall be prepared and validated through site/field investigations, studies, surveys, analyses, reports, schematic layouts/sketches, and program requirements for engineering and architectural work elements. All studies, surveys, analyses, reports, schematic layouts/sketches, and program requirements shall be in a format suitable for inclusion and preparation of Part 3 and/or Part 6 of a DB RFP. Services may include construction cost reduction evaluations and recommendations; bid analyses and verifications; validations of DD Form 1391 scope/cost estimate; peer review of cost estimates; review/analysis of contractor change order cost proposals; and assistance with claims, litigations, and negotiations with boards/committees. Services may include the preparation of project schedules and construction cost loaded schedules using Microsoft Project and Primavera (P6), respectively. Value Engineering (VE) services shall include facilitating and forming multi-discipline technical teams to conduct VE and/or Function Analysis Concept Development (FACD) Workshops for variety of projects. Services in support of VE and FACD Workshops may include site investigations; preparation and/or review of engineering studies/reports; cost estimates; facility and infrastructure assessments; risk assessments; Life Cycle Cost Engineering and/or Total Ownership Cost analyses; and schematic layouts/sketches. The maximum contract value may not exceed $5,000,000 aggregate total. The minimum guarantee for the contract shall be $5,000. The minimum guarantee for the entire contract term (including option years) will be satisfied by the award of the initial task order. The minimum value of individual task orders executed under this contract is $5,000. The maximum value of individual task orders executed under this contract is $1,500,000. There will be no dollar limit per year. Multiple task orders may be awarded with similar completion schedules and overlapping delivery dates. Contract term is for a one-year base period with two option periods. Each performance period will run 365 calendar days. The hourly rates will be negotiated for each performance period. The Government may exercise the option period unilaterally. Per NFAS 17.208-100(c)(1), options for post construction award services may be negotiated on individual task orders for unilateral exercise. The estimated start date is September 2012. Brooks Act and Federal Acquisition Regulations (FAR) Part 36.6 selection procedures apply. This is an Unrestricted procurement. The NAICS Code for this procurement is 541330 and the annual small business size standard is $4.5 Million. The Government makes no representation as to the number of task orders or the actual amount of work to be ordered. Contractors are not guaranteed work in excess of the minimum guarantee. Firms that design or prepare specifications for a construction contract or task order issued under the resulting contract are prohibited from providing the subsequent construction. This limitation also applies to subsidiaries/affiliates of the firm. SELECTION CRITERIA AND SUBMITTAL REQUIREMENTS: The selection will be based on the following criteria: Criterion 1, Professional Qualifications (SF 330, Section E); Criterion 2, Recent Team Experience (SF 330, Section F); The remaining Criteria is to be addressed in SF 330, Section H: Criterion 3, Capacity; Criterion 4, Past Performance; Criterion 5, Location; Criterion 6, Quality Control; Criterion 7, Sustainable Design; Criterion 8, Commitment to Small Business; and Criterion 9, Volume of Work. Criteria 1 and 2 are of equal importance and the remaining criteria are listed in descending order of importance. SF 330s will be evaluated to determine the most highly qualified firm based on criterion responses. Evaluating past performance and experience may include information provided by the firm, customer inquiries, Government databases, and publicly available sources. Failure to provide requested data, accessible points of contact, or valid phone numbers could result in a firm being considered less qualified. In evaluating an Offerorâ\u0080\u0099s capability, the Government shall consider how well the offeror complied with these instructions. All projects provided in the SF 330 (Architect-Engineer Qualifications) must be completed by the office/branch/individual team member actually performing the work under this contract. Projects not performed by the office/branch/individual team member will be excluded from evaluation consideration. Submission Requirements: The SF 330 Part 1 is limited to 30, 8.5\"x11\" pages. Minimum font size is 10. Submit the following: a) One (1) original and two (2) copies of the SF 330 for the prime offeror (which also includes a completed Part II for the firm and key subconsultants) addressing following selection criterion information; and b) one compact disk copy, in Adobe Acrobat format, of the complete SF330 being submitted by the firm. SF330, Part 1, Section B: Contract Information: In Block 5, list firm's Dun and Bradstreet Number in addition to the name of the firm. SF330, Part 1, Section D: Organization Chart: In addition to the Instructions provided for the SF 330, identify the overall relationship and lines of authority of the proposed team, including key subconsultants. (Note: All individuals listed on the organization chart are not required to have a resume in Section E, such as administrative or lower level engineering positions.) This chart shall not be counted as part of the 30 page limitation. This chart must be affixed to the submittal to avoid separation in handling. SF 330, Part 1, Section E, Resumes of Key Personnel, CRITERION 1, PROFESSIONAL QUALIFICATIONS: Professional qualifications of the proposed team members assigned to this project in Architect-Engineer (A-E) services including the preparation of the required services. The prime contractor must have one or more professionally registered engineer(s) employed within their office that is/are certified by either the American Association of Cost Engineers (AACE) as Certified Cost Engineer (CCE) or the American Society of Professional Estimators (ASPE) as Certified Professional Estimator (CPE). The Primeâ\u0080\u0099s Project Lead shall be a certified cost professional and a professionally registered engineer/architect. The majority of the services anticipated under this contract will be Cost Engineering (CE) Services. In addition, Value Engineering (VE) Services are required. The value engineer shall perform the required Value Engineering Services and must be a professionally registered engineer/architect and certified by the Society of American Value Engineers (SAVE) as a Certified Value Specialist (CVS). The Value Engineering Services may be performed by the prime contractor or a subcontractor. Submission Requirements: Provide brief resumes of each proposed team member who will specifically perform the major tasks listed above for this project. All key personnel must be professionally registered/certified in their discipline. Provide the highest level of education achieved and the number of years engaged in the discipline. Each resume shall include a maximum of five (5) specific, recently completed projects that best illustrate the individual memberâ\u0080\u0099s qualifications in performing the listed CE or VE services. \"Recent\" is defined as professional services completed within the past five years. Note: Recent projects completed in California may receive a higher rating for this factor. SF 330, Part 1, Section F, Example Projects, CRITERION 2, RECENT TEAM EXPERIENCE: Specialized experience and technical competence of the proposed team members assigned to this project experienced in the preparation of the required services. Submission Requirements: For the proposed team, provide a maximum of ten (10) specific, recently completed projects that best illustrate overall team experience. \"Recent\" is defined as professional services completed within the past five years. Include within block 24 of the SF330, Section F, a brief narrative for each project and detailed description of the work performed by the firm/Team as it relates to the listed CE or VE services. Discuss effectiveness of CE/VE work performed by conformance to scope, adherence to performance schedules, and delivering a cost effective product that satisfies the requirements. Note: Recent projects completed in California may receive a higher rating for this factor. SF330, Part 1, Section G, Key Personnel Participation in Example Projects: Submit in accordance with the SF 330 Instructions. From the total projects listed in Section F, provide a maximum of ten (10) projects. SF330, Part 1, Section H, Additional Information requested by Agency. Address the remaining Criteria 3 through 9; additional sheets may be used up to the maximum of 30 total pages for Part 1, if required. See submission requirements. Clearly identify the Criterion number and title. CRITERION 3, CAPACITY: Capacity to accomplish the work in the required time. Submission Requirements: Describe firm's capacity to accomplish work in required time frames. Indicate the firmâ\u0080\u0099s present workload and the availability of the project team (including consultants) for the specified contract performance period. Address ability to perform the work to schedules and capacity to accomplish multiple, large and small tasks simultaneously. Indicate specialized equipment available. Indicate the firmâ\u0080\u0099s and key personnel prior security clearances. CRITERION 4, PAST PERFORMANCE: Past performance with Government agencies and private industry with respect to quality of work. Points of contact provided in other criteria may be contacted. A proposal with no record of relevant past performance information shall be evaluated neither favorably nor unfavorably. Submission Requirements: Show past performance on CE/VE related contracts with government agencies and private industry (with emphasis on projects addressed in evaluation Criterion 2, Recent Team Experience). List recent awards, commendations, and other performance evaluations (do not submit copies). \"Recent\" defined as completed within the past five years. Note: Superior performance ratings on recently completed contracts may result in a higher rating for this factor. CRITERION 5, LOCATION: Firm's location within and demonstrated knowledge of the general geographical areas in which projects could be located. The work for this contract shall occur at various Navy and Marine Corps facilities and other military installations located in Arizona, California, Colorado, Nevada, New Mexico and Utah. The selected firm, on occasion, may be tasked with providing services at locations within the continental United States, including Alaska. Submission Requirements: Indicate Firm's location of main offices, branch offices, and sub-consultants offices. Describe and illustrate the teamâ\u0080\u0099s knowledge and availability to work in the geographical area. Address ability of the firm to ensure timely response to requests for on site support. Note: Firms with a local office in the Southern California area may receive a higher rating for this factor. CRITERION 6, QUALITY CONTROL: Demonstrated success of the Quality Control (QC) program used by the firm to ensure quality products. Submission Requirements: Address Quality Control program and the success of the program used by the firm. Describe who is primarily responsible for the QC program and how the prime firm ensures quality consistently across the entire team and how quality of subcontractors work is assured. Briefly describe internal quality assurance procedures and indicate effectiveness. Address the team's QC processes for checking documents for errors, omissions and quality and incorporating and tracking review comments. Of special interest are the QC processes in place that minimizes the government's effort to QA the AE's work product for errors, omissions and quality. Indicate team members who are responsible for monitoring these processes. CRITERION 7, SUSTAINABLE DESIGN: Demonstrated success and knowledge in sustainable design. Submission Requirements: Describe the team's knowledge of and experience with the Leadership in Energy and Environmental Design (LEED) program, the use of recovered materials, and sustainable principles and concepts. CRITERION 8, COMMITMENT TO SMALL BUSINESS: (To be addressed by all firms, including small businesses). Use of small business concerns as subconsultants. Submission Requirements: Demonstrate commitment and use of small business concerns as subconsultants on this contract. Provide a brief narrative identifying and committing to the following small business subcontracting goals: Small Business (SB) â\u0080\u0093 66.41%; Small Disadvantaged Business â\u0080\u0093 16.76%; Woman-Owned Small Business â\u0080\u0093 14.85%; Hubzone â\u0080\u0093 8.63%; Service-Disabled Veteran-Owned Small Business â\u0080\u0093 2.88%; Veteran-Owned Small Business â\u0080\u0093 2.88%. Address how the small business identified as subconsultants in your SF330 will meet the subcontracting goals by detailing subcontractor name, DUNS number, small business socio-economic category (ies), what type of service the subcontractor performs and list subcontracting percentage the subcontractor will meet in their respective socio-economic category. Note: Firms slated for an interview will be required to submit a subcontracting plan that reflects a minimum of the subcontracting goals stated above prior to the interview. Note: Firms demonstrating a high level of utilization of small business in subcontractor roles may receive a higher rating in this factor. CRITERION 9, VOLUME OF WORK: Volume of DOD work awarded to firm in past 12 months with objective of equitably distributing contracts among firms, including minority owned firms and firms without prior DOD contracts. Submission Requirements: Provide a list of DOD contracts/task orders awarded in the last 12 months. Include the dollar amount for each DOD contract/task order awarded. Firms with multiple offices shall indicate which branch office completed each project. Include agency phone numbers and points of contact. SELECTION INTERVIEW REQUIREMENTS: Personal interviews may be scheduled for firms slated as most highly qualified. Firms slated for interviews may be asked to explain management and the Firms abilities. Elaborate presentations are not desired. ADDITIONAL INFORMATION: All information must be included in the SF 330 package, (cover letter, attachments and excess number of pages will be excluded from the evaluation process). Only the information provided in the SF 330 will be evaluated. Per DFAR 252.204.7004, firms must be registered with Central Contractor Registration (CCR) prior to contract award. Registration information is available at the CCR website, http://www.ccr.gov. In accordance with the Brooks Act, the AE Firm must be a registered/licensed architectural and/or engineering firm and will be required to submit such proof prior to the interview phase of the selection process. Those firms that meet the requirements described in this announcement and wish to be considered must submit the SF 330, per submission requirements. One copy of the submittal package (original, plus 2 copies and CD) is to be received in this office (NAVFAC Southwest, Attn: Laurel Colon, Code RAQ20.LC, 1220 Pacific Highway , San Diego, CA 92132) no later than, 2:00 P.M. Pacific Standard Time on Monday, March 12, 2012. Facsimile and emailed SF 330's will not be accepted. Submittals received after this date and time will not be considered. Read the following information carefully. It is an Offeror's responsibility to deliver its SF 330 to the proper place at the proper time which includes allowing a reasonable amount of time for the delivery of the SF 330 (FAR 15.208(a)). Offerors shall ensure that SF 330s are mailed or sent by courier in a timely manner to be delivered to the NAVFAC Southwest facility no later than the date and time stated in this notice. An Offeror risks the late receipt and rejection of their SF 330 when it delays delivering its SF 330 until the last few minutes before the time set for receipt of SF 330s. Offerors intending to deliver the SF 330 in person to the facility at the address above are cautioned that this NAVFAC Southwest facility is located in downtown San Diego. It is recommended that the Offeror allows for delays in driving through downtown San Diego caused by traffic (both freeway and downtown), train/trolley crossing, parking at the pay lots/meters near the facility, and gaining access to a secure Government facility. No parking or offloading of SF 330s is available at the Government facility. SF 330s are to be delivered to the mailroom in Building 128 and reasonable time shall be allowed for the person in the mailroom to receive and time stamp the SF 330. The stamp time is determined from the NAVFAC Southwest facility mailroom time stamp and not any other time keeping equipment that the Offeror may own. Immediately upon SF 330 delivery the Offeror shall leave the Government facility. An Offeror that does not leave the premises may be requested to leave or be escorted by the Government. THIS IS NOT A REQUEST FOR PROPOSAL. ALL INFORMATION NEEDED TO SUBMIT SF 330 DOCUMENTS IS CONTAINED HEREIN. NO SOLICITATION PACKAGE, TECHNICAL INFORMATION, OR BIDDER/PLAN HOLDER LIST WILL BE ISSUED. It is the offeror's responsibility to check the NAVFAC electronic solicitation website NECO (Navy Electronic Commerce Online) at: https://www.neco.navy.mil for any revisions to this announcement or other notices. Plan-holder list is available via the NECO website and an Interested Vendors List is available via the FedBizOpps website, www.fbo.gov, under this solicitation number. Address inquiries via email: laurel.colon@navy.mil or via telephone: 619-532-4514 *** END OF ANNOUNCEMENT ***",
            "DEPARTMENT": "Dept Of Defense",
            "AGENCY": "Dept Of The Navy",
            "AGENCY_OFFICE": "Navfacsyscom Southwest",
            "FIRST_POSTED_DATE": "2012-02-09 13:22:25-05:00",
            "RESPONSE_DEADLINE": "2012-03-28 00:00:00-05:00",
            "NAICS_CODE": 541330,
            "NAICS_DESCRIPTION": "Engineering Services",
            "SPECIAL_AWARD_PROVISION": null,
            "PERFORMANCE_CITY": null,
            "PERFORMANCE_STATE": null,
            "PERFORMANCE_ZIPCODE": null,
            "PERFORMANCE_COUNTRY": null,
            "PERFORMANCE_GEO_ID_CITY": null,
            "PERFORMANCE_GEO_ID_STATE": null,
            "PERFORMANCE_GEO_ID_ZIP": null,
            "PERFORMANCE_GEO_ID_COUNTRY": null
        },
        {
            "CONTRACT_SOLICITATION_ID": "W9128F19B0037",
            "ORIGINAL_CONTRACT_TITLE": "Mud Creek, Broken Bow, Nebraska",
            "ORIGINAL_CONTRACT_DESCRIPTION": "Broken Bow, Nebraska. This was issued under the Prequlification of Sources List (PLS 1) W9128F19R0064.",
            "DEPARTMENT": "Dept Of Defense",
            "AGENCY": "Dept Of The Army",
            "AGENCY_OFFICE": "W071 Endist Omaha",
            "FIRST_POSTED_DATE": "2019-09-26 11:22:38-04:00",
            "RESPONSE_DEADLINE": "NaT",
            "NAICS_CODE": 237990,
            "NAICS_DESCRIPTION": "Other Heavy and Civil Engineering Construction",
            "SPECIAL_AWARD_PROVISION": null,
            "PERFORMANCE_CITY": null,
            "PERFORMANCE_STATE": null,
            "PERFORMANCE_ZIPCODE": null,
            "PERFORMANCE_COUNTRY": null,
            "PERFORMANCE_GEO_ID_CITY": null,
            "PERFORMANCE_GEO_ID_STATE": null,
            "PERFORMANCE_GEO_ID_ZIP": null,
            "PERFORMANCE_GEO_ID_COUNTRY": null
        }
    ],
    "table_name": "CYBERSYN.GOVERNMENT_CONTRACT_INDEX",
    "table_fullname": "GLOBAL_GOVERNMENT.CYBERSYN.GOVERNMENT_CONTRACT_INDEX",
    "column_names": [
        "PERFORMANCE_GEO_ID_ZIP",
        "PERFORMANCE_STATE",
        "ORIGINAL_CONTRACT_TITLE",
        "PERFORMANCE_ZIPCODE",
        "ORIGINAL_CONTRACT_DESCRIPTION",
        "DEPARTMENT",
        "PERFORMANCE_GEO_ID_COUNTRY",
        "AGENCY_OFFICE",
        "PERFORMANCE_COUNTRY",
        "CONTRACT_SOLICITATION_ID",
        "PERFORMANCE_CITY",
        "SPECIAL_AWARD_PROVISION",
        "FIRST_POSTED_DATE",
        "PERFORMANCE_GEO_ID_CITY",
        "NAICS_CODE",
        "AGENCY",
        "RESPONSE_DEADLINE",
        "PERFORMANCE_GEO_ID_STATE",
        "NAICS_DESCRIPTION"
    ],
    "column_types": [
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TIMESTAMP_TZ",
        "TEXT",
        "NUMBER",
        "TEXT",
        "TIMESTAMP_TZ",
        "TEXT",
        "TEXT"
    ],
    "description": [
        "The unique identifier for the contract fulfillment zipcode that is joinable to the GEOGRAPHY_INDEX",
        "The state location where the contract will be fulfilled",
        "A short summary of the goods and services to be provided to the Federal government in the contract.",
        "The zipcode location where the contract will be fulfilled",
        "A detailed statement of work and requirements of the services or products to be provided to the Federal government in the contract.",
        "The Federal Department seeking services or products (e.g., Dept of Defense)",
        "The unique identifier for the contract fulfillment country that is joinable to the GEOGRAPHY_INDEX",
        "The specific office within the agency handling the contract (e.g., Naval Research Laboratory)",
        "The country location where the contract will be fulfilled",
        "Unique solicitation number provided by the System for Award Management (sam.gov) for a specific contract.  Joinable to the GOVERNMENT_CONTRACT_AWARD_INDEX table.",
        "The city location where the contract will be fulfilled",
        "Indication of exclusivity for all or part of a contract to be set aside or reserved for a small or underrepresented business",
        "The earliest date the contract was posted on the System for Award Management (sam.gov)",
        "The unique identifier for the contract fulfillment city that is joinable to the GEOGRAPHY_INDEX",
        "The North American Industry Classification System code that best classifies the goods or services in the contract opportunity",
        "The agency underneath the department offering the contract (e.g., Dept of Navy)",
        "Deadline for organizations to submit proposals for the contract",
        "The unique identifier for the contract fulfillment state that is joinable to the GEOGRAPHY_INDEX",
        "Human-readable description of the industry related to the contract"
    ]
}