[
    {
        "instance_id": "bq011",
        "db": "bigquery-public-data.ga4_obfuscated_sample_ecommerce",
        "question": "How many pseudo users were active in the last 7 days but inactive in the last 2 days as of January 7, 2021?",
        "external_knowledge": "ga4_obfuscated_sample_ecommerce.events.md"
    },
    {
        "instance_id": "bq010",
        "db": "bigquery-public-data.google_analytics_sample",
        "question": "Find the top-selling product among customers who bought 'Youtube Men’s Vintage Henley' in July 2017, excluding itself.",
        "external_knowledge": "google_analytics_sample.ga_sessions.md"
    },
    {
        "instance_id": "bq009",
        "db": "bigquery-public-data.google_analytics_sample",
        "question": "Which traffic source receives the top revenue in 2017 and what is the difference (millions, rounded to two decimal places) between its highest and lowest revenue months?",
        "external_knowledge": "google_analytics_sample.ga_sessions.md"
    },
    {
        "instance_id": "bq001",
        "db": "bigquery-public-data.google_analytics_sample",
        "question": "I wonder how many days between the first transaction and the first visit for each transacting visitor in Feburary 2017, along with the device used in the transaction.",
        "external_knowledge": "google_analytics_sample.ga_sessions.md"
    },
    {
        "instance_id": "bq002",
        "db": "bigquery-public-data.google_analytics_sample",
        "question": "What's the maximum monthly, weekly, and daily product revenues (in millions) generated by the top-performing traffic source in the first half of 2017?",
        "external_knowledge": "google_analytics_sample.ga_sessions.md"
    },
    {
        "instance_id": "bq003",
        "db": "bigquery-public-data.google_analytics_sample",
        "question": "Compare the average pageviews per visitor between purchase and non-purchase sessions for each month from April to July in 2017.",
        "external_knowledge": "google_analytics_sample.ga_sessions.md"
    },
    {
        "instance_id": "bq004",
        "db": "bigquery-public-data.google_analytics_sample",
        "question": "What's the most popular other purchased product in July 2017 with consumers who bought products relevant to YouTube?",
        "external_knowledge": "google_analytics_sample.ga_sessions.md"
    },
    {
        "instance_id": "bq008",
        "db": "bigquery-public-data.google_analytics_sample",
        "question": "What's the most common next page for visitors who were part of \"Data Share\" campaign and after they accessed the page starting with '/home' in January 2017. And what's the maximum duration time (in seconds) when they visit the corresponding home page?",
        "external_knowledge": "google_analytics_sample.ga_sessions.md"
    },
    {
        "instance_id": "bq029",
        "db": "patents-public-data.patents",
        "question": "Get the number of patent publications and the average number of inventors per patent in the US every five years from 1945 to 2020?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq026",
        "db": "patents-public-data.patents",
        "question": "For the assignee who has been the most active in the patent category 'A61K39', I'd like to know the five patent jurisdictions code where they filed the most patents during their busiest year, separated by commas.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq026_1",
        "db": "patents-public-data.patents",
        "question": "In which year did the assignee with the most applications in the patent category 'A61K39' file the most?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq026_2",
        "db": "patents-public-data.patents",
        "question": "For patent class A01B3, I want to analyze the information of the top 20 assignees based on the total number of applications. Please provide the following five pieces of information: the names of these assignees, their total number of applications, the year with the most applications, the number of applications in that year, and the country code with the most applications during that year.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq033",
        "db": "patents-public-data.patents",
        "question": "How many US patent applications about IoT applications were filed each month from 2008 to 2022?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq209",
        "db": "patents-public-data.patents",
        "question": "Could you find out which US utility patent granted in January 2010, with a published application, has the most forward citations over the ten years following its application date?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq027",
        "db": "patents-public-data.patents",
        "question": "For US B2 patents granted in the first seven days of January 2018, tell me the publication number of each patent and the number of backward citations it has received in the SEA category.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq210",
        "db": "patents-public-data.patents",
        "question": "How many US B2 patents granted between 2015 and 2018 contain claims that do not include the word 'claim'?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq211",
        "db": "patents-public-data.patents",
        "question": "Among the US utility B2 patents granted in January 2008, how many of them belong to families that have a total of over 300 distinct applications?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq213",
        "db": "patents-public-data.patents",
        "question": "What is the most common 4-digit IPC code among US B2 utility patents granted in the first seven days of June 2018?",
        "external_knowledge": "patents_info.md"
    },
    {
        "instance_id": "bq213_1",
        "db": "patents-public-data.patents",
        "question": "For US B2 utility patents granted in April 2015, identify the most frequent 4-digit IPC code for each patent. Then, list the publication numbers and IPC4 codes of patents where this code appears 20 or more times.",
        "external_knowledge": "patents_info.md"
    },
    {
        "instance_id": "bq214",
        "db": "patents-public-data.patents",
        "question": "For the 'B2' publication granted in January 2017 in the US that received the most forward citations within a month of its filing date, determine the publication number of the most similar patent from the same filing year.",
        "external_knowledge": "patents_info.md"
    },
    {
        "instance_id": "bq214_1",
        "db": "patents-public-data.patents",
        "question": "Identify the top five patents filed in the same year as `US-9023721-B2` that are most similar to it based on technological similarities. Please provide the publication numbers.",
        "external_knowledge": "patents_info.md"
    },
    {
        "instance_id": "bq215",
        "db": "patents-public-data.patents",
        "question": "What is the publication number of US patent granted at January 2018, with the highest originality score based on the diversity of 4-digits IPC codes from its backward citations?",
        "external_knowledge": "patents_info.md"
    },
    {
        "instance_id": "bq221",
        "db": "patents-public-data.patents",
        "question": "Identify the CPC technology areas with the highest exponential moving average of patent filings each year (smoothing factor 0.2), and provide the full title and the best year for each CPC group at level 5.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq222",
        "db": "patents-public-data.patents",
        "question": "Find the CPC technology areas in Germany with the highest exponential moving average of patent filings each year (smoothing factor 0.1) for patents granted in December 2016. Show me the full title, CPC group and the best year for each CPC group at level 4.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq223",
        "db": "patents-public-data.patents",
        "question": "Which assignee and primary CPC subclass full title most frequently cite patents assigned to 'AAAA'?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq052",
        "db": "patents-public-data.patentsview",
        "question": "I wonder which patents within CPC subsection 'C05' or group 'A01G' in the USA have at least one forward or backward citations within one month of their application dates. Give me the ids, titles, application date, forward/backward citation counts and summary texts.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq207",
        "db": "patents-public-data.patents\npatents-public-data.uspto_peds",
        "question": "Can you provide the initial publication numbers for our top 100 independent patent claims with the highest word count?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq036",
        "db": "bigquery-public-data.github_repos",
        "question": "What was the average number of GitHub commits made per month in 2020 for repositories containing Python code?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq100",
        "db": "bigquery-public-data.github_repos",
        "question": "Find out the most frequently used package in all Go source files.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq101",
        "db": "bigquery-public-data.github_repos",
        "question": "Identify the top 10 most frequently imported packages and their counts in Java source files.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq182",
        "db": "bigquery-public-data.github_repos\ngithubarchive.day",
        "question": "Which primary programming languages, determined by the highest number of bytes in each repository, have its repositories having at least a total of 100 pull requests on January 18, 2023?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq182_1",
        "db": "bigquery-public-data.github_repos\ngithubarchive.day",
        "question": "How many pull requests in total were created in repositories that include JavaScript as one of their languages, considering data from January 18, 2023?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq191",
        "db": "bigquery-public-data.github_repos\ngithubarchive.year",
        "question": "Find the top 5 repositories from 2017, which have more than 300 unique users watching them, that also have a `pom.xml` file containing the text `<artifactId>junit</artifactId>`. List these repositories in descending order of the watches they have.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq224",
        "db": "bigquery-public-data.github_repos\ngithubarchive.month",
        "question": "Which repository with an approved license in `licenses.md` had the highest combined total of forks, issues, and watches in April 2022?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq192",
        "db": "bigquery-public-data.github_repos",
        "question": "Which repository that has a license of either \"artistic-2.0\", \"isc\", \"mit\", or \"apache-2.0\", contains Python files in the master branch, and has the highest combined count of forks, issues, and watch events in April 2022?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq225",
        "db": "bigquery-public-data.github_repos",
        "question": "What's the top 3 widely used languages according to file counts?",
        "external_knowledge": "lang_and_ext.md"
    },
    {
        "instance_id": "bq180",
        "db": "bigquery-public-data.github_repos",
        "question": "Please help me retrieve the top 3 most frequently used module names from Python and R scripts.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq180_1",
        "db": "bigquery-public-data.github_repos",
        "question": "Can you find the top 5 most frequently imported Python modules and R libraries from the GitHub sample files and list them along with their occurrence counts? Please sort the results by language and then by the number of occurrences in descending order.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq193",
        "db": "bigquery-public-data.github_repos",
        "question": "Help me find the third most frequently occurring non-empty line of text in `requirements.txt` files from GitHub repositories that primarily use Python for development.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq295",
        "db": "bigquery-public-data.github_repos",
        "question": "Among the repositories from the GitHub Archive which include a Python file with less than 15,000 bytes in size and a keyword 'def' in the content, find the top 3 that have the highest number of watch events in 2017?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq194",
        "db": "bigquery-public-data.github_repos",
        "question": "What is the second most frequently used module (imported library) across Python, R, and IPython script (.ipynb) files in the GitHub sample dataset?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq019",
        "db": "bigquery-public-data.cms_medicare",
        "question": "For the most common inpatient diagnosis in the US in 2014, what was the citywise average payment respectively in the three cities that had the most cases?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq019_1",
        "db": "bigquery-public-data.cms_medicare",
        "question": "What is the most prescribed medication in each state in 2014?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq019_2",
        "db": "bigquery-public-data.cms_medicare",
        "question": "Can you tell me which healthcare provider incurs the highest combined average costs for both outpatient and inpatient services in 2014?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq172",
        "db": "bigquery-public-data.cms_medicare",
        "question": "For the drug with the highest total number of prescriptions in New York State during 2014, could you list the top five states with the highest total claim counts for this drug? Please also include their total claim counts and total drug costs. ",
        "external_knowledge": null
    },
    {
        "instance_id": "bq172_1",
        "db": "bigquery-public-data.cms_medicare",
        "question": "For the provider with the highest total inpatient service cost from 2011-2015, tell me its annual inpatient and outpatient costs for each year during that period.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq129",
        "db": "bigquery-public-data.cms_medicare\nbigquery-public-data.census_bureau_usa",
        "question": "What are the top 10 ZIP Code regions with populations over 1000 that have the highest number of Medicare-certified MD providers per capita?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq032",
        "db": "bigquery-public-data.noaa_hurricanes",
        "question": "Can you provide the latitude of the final coordinates for the hurricane that traveled the second longest distance in the North Atlantic during 2020?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq032_1",
        "db": "bigquery-public-data.noaa_hurricanes",
        "question": "Please show information of the hurricane with the third longest total travel distance, including its travel coordinates, the cumulative travel distance at each point, and the maximum sustained wind speed at those times.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq117",
        "db": "bigquery-public-data.noaa_historic_severe_storms",
        "question": "What is the total number of severe storm events that occurred in the most affected month over the past 15 years according to NOAA records, considering only the top 100 storm events with the highest property damage?",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq071",
        "db": "bigquery-public-data.noaa_hurricanes\nbigquery-public-data.geo_us_boundaries",
        "question": "What are the top 10 zip codes of the areas in the United States that have been affected by the most named hurricanes?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq117_1",
        "db": "bigquery-public-data.noaa_historic_severe_storms\nbigquery-public-data.geo_us_boundaries.zip_codes",
        "question": "What are the top 5 zip codes of the areas in the United States that have experienced the most hail storm events in the past 10 years?",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq181",
        "db": "bigquery-public-data.noaa_gsod",
        "question": "How much percentage of weather stations recorded temperature data for at least 90% of the days in 2022?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq045",
        "db": "bigquery-public-data.noaa_gsod",
        "question": "Which weather stations in Washington State had more than 150 rainy days in 2023 but fewer rainy days than in 2022?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq290",
        "db": "bigquery-public-data.noaa_gsod",
        "question": "Can you calculate the difference in maximum temperature, minimum temperature, and average temperature between US and UK weather stations for each day in October 2023, excluding records with missing temperature values?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq031",
        "db": "bigquery-public-data.noaa_gsod",
        "question": "Show me the daily weather data (temperature, precipitation, and wind speed) in Rochester for the first season of year 2019, converted to Celsius, centimeters, and meters per second, respectively. Also, include the moving averages (window size = 8) and the differences between the moving averages for up to 8 days prior (all values rounded to one decimal place, sorted by date in ascending order, and records starting from 2019-01-09).",
        "external_knowledge": null
    },
    {
        "instance_id": "bq291",
        "db": "spider2-public-data.noaa_global_forecast_system",
        "question": "What is the daily weather forecast summary, including temperature stats (max, min and average), precipitation, cloud cover, snow and rain, for the specified location (latitude 17.5, longitude 23.25) and on November 28, 2021?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq208",
        "db": "bigquery-public-data.new_york\nbigquery-public-data.noaa_gsod",
        "question": "Can you provide weather stations within a 20-mile radius of Chappaqua, New York (Latitude: 41.197, Longitude: -73.764), and tell me the number of valid temperature observations they have recorded from 2011 to 2020?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq017",
        "db": "bigquery-public-data.geo_openstreetmap",
        "question": "What are the five longest types of highways within the multipolygon boundary of Japan (as defined by Wikidata ID 'Q17') by total length?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq131",
        "db": "bigquery-public-data.geo_openstreetmap",
        "question": "What is the number of bus stops for the bus network with the most stops within the multipolygon boundary of San Francisco (as defined by Wikidata ID 'Q62')?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq106",
        "db": "bigquery-public-data.geo_openstreetmap\nspider2-public-data.noaa_global_forecast_system",
        "question": "For the two-week forecast made on November 28th, 2021, how much did temperatures in Sudan deviate from the predicted value?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq293",
        "db": "bigquery-public-data.geo_us_boundaries\nbigquery-public-data.new_york",
        "question": "What were the top 5 busiest pickup times and locations (by ZIP code) for yellow taxi rides in New York City on January 1, 2015? Additionally, provide detailed metrics for each of these top 5 records, including the count of rides, hourly, daily, and weekly lagged counts, as well as 14-day and 21-day average and standard deviation of ride counts.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq056",
        "db": "bigquery-public-data.geo_openstreetmap\nbigquery-public-data.geo_us_boundaries",
        "question": "How many different motorway road pairs are there in Minnesota that overlap each other but do not share nodes and do not have a bridge?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq184",
        "db": "bigquery-public-data.crypto_ethereum",
        "question": "I want to compute and compare the cumulative count of Ethereum smart contracts created by users versus created by other contracts. Please list out the daily cumulative tallies in August 2021.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq195",
        "db": "spider2-public-data.crypto_ethereum",
        "question": "What are the top 10 Ethereum addresses by balance, considering both value transactions and gas fees, before September 1, 2021?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq186",
        "db": "bigquery-public-data.san_francisco.bikeshare_trips",
        "question": "Please help me calculate the first, last, highest, and lowest bike trip durations in minutes for each month.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq339",
        "db": "bigquery-public-data.san_francisco_bikeshare",
        "question": "Which month in 2017 had the largest absolute difference between cumulative bike usage minutes for customers and subscribers?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq059",
        "db": "bigquery-public-data.san_francisco_bikeshare",
        "question": "What is the highest average speed (rounded to 1 decimal, in metric m/s) for bike trips in Berkeley with trip distance greater than 1000 meters?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq006",
        "db": "bigquery-public-data.austin_incidents",
        "question": "What is the date with the second highest Z-score for daily counts of 'PUBLIC INTOXICATION' incidents in Austin for the year 2016? List the date in the format of '2016-xx-xx'.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq187",
        "db": "bigquery-public-data.ethereum_blockchain",
        "question": "What is the total circulating supply balances of the 'BNB' token for all addresses (excluding the zero address), based on the amount they have received (converted by dividing by 10^18) minus the amount they have sent?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq014",
        "db": "bigquery-public-data.thelook_ecommerce",
        "question": "Can you help me figure out the revenue for the product category that has the highest number of customers making a purchase in their first non-cancelled and non-returned order?",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq188",
        "db": "bigquery-public-data.thelook_ecommerce",
        "question": "What is the average time in minutes that users spend per visit on the product category with the highest total quantity purchased?",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq189",
        "db": "bigquery-public-data.thelook_ecommerce",
        "question": "What is the average monthly revenue growth rate for the product category with the highest average monthly order growth rate based on completed orders?",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq262",
        "db": "bigquery-public-data.thelook_ecommerce",
        "question": "Help me generate a monthly analysis report on e-commerce sales in the second half of 2019, which should contain the total sum of order count/revenue/profit as well as their growth rates for each product category monthly. Please sort the results by months (e.g., 2019-07) and product categories in ascending order.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq190",
        "db": "bigquery-public-data.thelook_ecommerce",
        "question": "What is the count of the youngest and oldest users respectively, broken down by gender from January 2019 to April 2022?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq197",
        "db": "bigquery-public-data.thelook_ecommerce",
        "question": "What are the top-selling products by sales volume and revenue for June 2024 and each month before, considering only completed orders?",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq020_1",
        "db": "bigquery-public-data.genomics_cannabis",
        "question": "What is the name of the reference sequence with the highest variant density in the given cannabis genome dataset?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq020_2",
        "db": "bigquery-public-data.genomics_cannabis",
        "question": "What is the variant density of the cannabis reference with the longest reference length?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq025",
        "db": "bigquery-public-data.census_bureau_international",
        "question": "Provide a list of the top 10 countries for the year 2020, ordered by the highest percentage of their population under 20 years old. For each country, include the total population under 20 years old, the total midyear population, and the percentage of the population that is under 20 years old.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq025_1",
        "db": "bigquery-public-data.census_bureau_international",
        "question": "Which country has the highest percentage of population under the age of 25 in 2017?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq338",
        "db": "bigquery-public-data.census_bureau_acs\nbigquery-public-data.geo_census_tracts",
        "question": "Which Brooklyn census tract (by geo ID) had the largest increase in median income from 2010 to 2017?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq088",
        "db": "bigquery-public-data.covid19_symptom_search",
        "question": "Can you provide the average levels of anxiety and depression symptoms in the United States for the years 2019 and 2020, and calculate the percentage increase in these symptoms from 2019 to 2020?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq137",
        "db": "bigquery-public-data.census_bureau_usa\nbigquery-public-data.utility_us",
        "question": "Find details about zip code areas within 10 kilometers of the coordinates (-122.3321, 47.6062), including their geographic polygons, land and water area in meters, latitude and longitude points, state code, state name, city, county, and population from the 2010 census data.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq023",
        "db": "bigquery-public-data.census_bureau_acs\nbigquery-public-data.fec\nbigquery-public-data.hud_zipcode_crosswalk\nbigquery-public-data.geo_census_tracts",
        "question": "What are the average political donation amounts and median incomes for each census tract identifier in Kings County (Brooklyn), NY, using data from the 2018 ACS and 2020 FEC contributions?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq060",
        "db": "bigquery-public-data.census_bureau_international",
        "question": "Which top 3 countries had the highest net migration in 2017 among those with an area greater than 500 square kilometers? And what are their migration rates?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq061",
        "db": "bigquery-public-data.census_bureau_acs\nbigquery-public-data.geo_census_tracts",
        "question": "Which census tract has witnessed the largest increase in median income between 2015 and 2018 in California? Tell me the tract code.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq198",
        "db": "bigquery-public-data.ncaa_basketball",
        "question": "What are the top 5 most successful college basketball teams over the seasons from 1900 to 2000, based on the number of times they had the maximum wins in a season?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq016",
        "db": "spider2-public-data.deps_dev_v1",
        "question": "Considering only the highest release versions of PYPI packages, which one and its version has the most dependent packages?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq062",
        "db": "spider2-public-data.deps_dev_v1",
        "question": "What is the most frequently used license by packages in each system?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq063",
        "db": "spider2-public-data.deps_dev_v1",
        "question": "What is the github URL of the latest released package from the NPM system that have the highest number of dependencies? Exlcude those package whose names contain character '@' or the URL label is not 'SOURCE_REPO'.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq028",
        "db": "spider2-public-data.deps_dev_v1",
        "question": "Considering only the latest release versions of NPM package, which packages are the top 3 most popular based on the Github star number, as well as their versions?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq022",
        "db": "bigquery-public-data.chicago_taxi_trips",
        "question": "Given the taxi trip data in Chicago, tell me the total number of trips and average fare for each 10-minute interval (using rounded-off minutes) of trip durations no more than 1 hour.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq076",
        "db": "bigquery-public-data.chicago_crime",
        "question": "Which month generally has the greatest number of motor vehicle thefts in 2016?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq077",
        "db": "bigquery-public-data.chicago_crime",
        "question": "For each year from 2010 to 2016, what is the highest number of motor thefts in one month?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq350",
        "db": "open-targets-prod.platform",
        "question": "Please display the drug id, drug type and withdrawal status for approved drugs with a black box warning and known drug type among 'Keytruda', 'Vioxx', 'Premarin', and 'Humira'",
        "external_knowledge": null
    },
    {
        "instance_id": "bq351_1",
        "db": "open-targets-prod.platform",
        "question": "Which target approved symbol has the overall association score closest to the mean score for psoriasis?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq109",
        "db": "open-targets-genetics.genetics",
        "question": "Find the average, variance, max-min difference, and the QTL source(right study) of the maximum log2(h4/h3) for data where right gene id is \"ENSG00000169174\", h4 > 0.8, h3 < 0.02, reported trait includes \"lesterol levels\", right biological feature is \"IPSC\", and the variant is '1_55029009_C_T'.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq352",
        "db": "bigquery-public-data.sdoh_cdc_wonder_natality\nbigquery-public-data.census_bureau_acs",
        "question": "Please list the average number of prenatal weeks in 2018 for counties in Wisconsin where more than 5% of the employed population had commutes of 45-59 minutes in 2017.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq041",
        "db": "bigquery-public-data.stackoverflow",
        "question": "What are the monthly statistics for new StackOverflow users created in 2021, including the percentage of new users who asked questions and the percentage of those who asked questions and then answered questions within their first 30 days?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq123",
        "db": "bigquery-public-data.stackoverflow",
        "question": "Which day of the week has the third highest percentage of questions answered within an hour?",
        "temporal": "Yes",
        "external_knowledge": null
    },
    {
        "instance_id": "bq126",
        "db": "bigquery-public-data.the_met",
        "question": "What are the titles, artist names, mediums, and original image URLs of objects with 'Photograph' in their names from the 'Photographs' department, created by known artists, with an object end date of 1839 or earlier?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq042",
        "db": "bigquery-public-data.noaa_gsod",
        "question": "Help me analyze the weather conditions (including temperature, wind speed and precipitation) at NYC's airport LaGuardia for June 12, year over year, starting from 2011 to 2020.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq047",
        "db": "bigquery-public-data.noaa_gsod\nbigquery-public-data.new_york",
        "question": "Could you help me analyze the relationship between each complaint type and daily temperature in New York city, focusing on data in airports LaGuardia and JFK over the 10 years starting from 2008? Calculate the total complaint count, the total day count, and the Pearson correlation coefficient (rounded to 4 decimals) between temperature and both the count and percentage of each common (>5000 occurrences) and strongly correlated (absolute value > 0.5) complaint type.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq048",
        "db": "bigquery-public-data.noaa_gsod\nbigquery-public-data.new_york",
        "question": "Which common complaint types have the strongest positive and negative correlation with wind speed respectively, given the data in NYC JFK Airport from year 2011 to 2020? Also, provide the corresponding correlation values (rounded to 4 decimals).",
        "external_knowledge": null
    },
    {
        "instance_id": "bq329",
        "db": "bigquery-public-data.austin_bikeshare",
        "question": "Which bike station in the Austin bikeshare system has the lowest average trip duration? I want the station ID.",
        "external_knowledge": null
    },
    {
        "instance_id": "bq320",
        "db": "bigquery-public-data.idc_v11",
        "question": "What is the total count of StudyInstanceUIDs that have a segmented property type of '80891009' and belong to the 'Community' or 'nsclc_radiomics' collections?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq321",
        "db": "bigquery-public-data.idc_v14",
        "question": "How many unique StudyInstanceUIDs are there from the DWI, T2 Weighted Axial, Apparent Diffusion Coefficient series, and T2 Weighted Axial Segmentations in the 'qin_prostate_repeatability' collection?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq325",
        "db": "bigquery-public-data.open_targets_genetics",
        "question": "What are the top 10 genes with the lowest p-values across studies?",
        "external_knowledge": null
    },
    {
        "instance_id": "bq326",
        "db": "bigquery-public-data.world_bank_health_population",
        "question": "How many countries experienced both a change in population and a change in Current health expenditure per capita, PPP (current international $) of greater than 1 in the year 2018?",
        "external_knowledge": null
    },
    {
        "instance_id": "ga001",
        "db": "bigquery-public-data.ga4_obfuscated_sample_ecommerce",
        "question": "I want to know the preferences of customers who purchased the Google Navy Speckled Tee in December 2020. What other product was most frequently purchased alongside this item?",
        "external_knowledge": null
    },
    {
        "instance_id": "ga001_1",
        "db": "bigquery-public-data.ga4_obfuscated_sample_ecommerce",
        "question": "Tell me the most purchased other products and their quantities by customers who bought the Google Red Speckled Tee each month for the three months starting from November 2020.",
        "external_knowledge": null
    },
    {
        "instance_id": "ga003",
        "db": "firebase-public-project.analytics_153293282",
        "question": "I'm trying to evaluate which board types were most effective on September 15, 2018. Can you find out the average scores for each board type from the quick play mode completions on that day?\"",
        "external_knowledge": null
    },
    {
        "instance_id": "ga004",
        "db": "bigquery-public-data.ga4_obfuscated_sample_ecommerce",
        "question": "Can you figure out the average difference in pageviews between users who bought something and those who didn’t in December 2020? Just label anyone who was involved in purchase events as a purchaser.",
        "external_knowledge": null
    },
    {
        "instance_id": "ga004_1",
        "db": "bigquery-public-data.ga4_obfuscated_sample_ecommerce",
        "question": "Can you give me the average page views per buyer and total page views for each day in November 2020?",
        "external_knowledge": null
    },
    {
        "instance_id": "ga017",
        "db": "bigquery-public-data.ga4_obfuscated_sample_ecommerce",
        "question": "How many distinct users viewed the most frequently visited page during January 2021?",
        "external_knowledge": null
    },
    {
        "instance_id": "ga007",
        "db": "bigquery-public-data.ga4_obfuscated_sample_ecommerce",
        "question": "Please find out what percentage of the page views on January 2, 2021, were for PDP type pages.",
        "external_knowledge": "ga4_page_category.md"
    },
    {
        "instance_id": "ga007_1",
        "db": "bigquery-public-data.ga4_obfuscated_sample_ecommerce",
        "question": "I want to know all the pages visited by user 1402138.5184246691 on January 2, 2021. Please show the names of these pages and adjust the names to PDP or PLP where necessary.",
        "external_knowledge": "ga4_page_category.md"
    },
    {
        "instance_id": "ga018",
        "db": "bigquery-public-data.ga4_obfuscated_sample_ecommerce",
        "question": "I'd like to analyze the appeal of our products to users. Can you calculate the percentage of times users go from browsing the product list pages to clicking into the product detail pages at January 2nd, 2021?",
        "external_knowledge": "ga4_page_category.md"
    },
    {
        "instance_id": "ga031",
        "db": "bigquery-public-data.ga4_obfuscated_sample_ecommerce",
        "question": "I want to know our user conversion rate for January 2nd, 2021, calculated as the ratio of users who reached the Checkout Confirmation page to those who landed on the Home page.",
        "external_knowledge": null
    },
    {
        "instance_id": "ga032",
        "db": "bigquery-public-data.ga4_obfuscated_sample_ecommerce",
        "question": "Can you pull up the sequence of pages our customer 1362228 visited on January 28th 2021, linking them with '>>' between each page? I want to see their navigation flow through our site. Please merge adjacent identical pages into one, and refer to the docs to convert the corresponding pages to PDP, PLP if necessary.",
        "external_knowledge": "ga4_page_category.md"
    },
    {
        "instance_id": "ga006",
        "db": "bigquery-public-data.ga4_obfuscated_sample_ecommerce",
        "question": "Provide the IDs and the average spending per session for users who were engaged in multiple purchase sessions in November 2020",
        "external_knowledge": null
    },
    {
        "instance_id": "ga009",
        "db": "bigquery-public-data.ga4_obfuscated_sample_ecommerce",
        "question": "I want to know the average number of engaged sessions per user of December 2020.",
        "external_knowledge": null
    },
    {
        "instance_id": "ga010",
        "db": "bigquery-public-data.ga4_obfuscated_sample_ecommerce",
        "question": "Can you give me an overview of our website traffic for December 2020? I'm particularly interested in the channel with the fourth highest number of sessions.",
        "external_knowledge": "ga4_dimensions_and_metrics.md"
    },
    {
        "instance_id": "ga010_1",
        "db": "bigquery-public-data.ga4_obfuscated_sample_ecommerce",
        "question": "Please tell me the number of sessions for each website traffic channel in December 2020.",
        "external_knowledge": "ga4_dimensions_and_metrics.md"
    },
    {
        "instance_id": "ga011",
        "db": "bigquery-public-data.ga4_obfuscated_sample_ecommerce",
        "question": "What is the highest number of page views for any page path in December 2020?",
        "external_knowledge": null
    },
    {
        "instance_id": "ga012",
        "db": "bigquery-public-data.ga4_obfuscated_sample_ecommerce",
        "question": "Find the transaction IDs, total item quantities, and purchase revenues for the item category with the highest tax rate on November 30, 2020.",
        "external_knowledge": null
    },
    {
        "instance_id": "ga019",
        "db": "firebase-public-project.analytics_153293282",
        "question": "Could you determine what percentage of users either did not uninstall our app within seven days or never uninstalled it after installing during August and September 2018?",
        "external_knowledge": null
    },
    {
        "instance_id": "ga030",
        "db": "firebase-public-project.analytics_153293282",
        "question": "Can you group users by the week they first used the app starting from July 2, 2018 and show which group has the most active users remained in the next four weeks, with each group named by the Monday date of that week? Please answer in the format of \" YYYY-MM-DD\".",
        "external_knowledge": "retention_rate.md"
    },
    {
        "instance_id": "ga030_1",
        "db": "firebase-public-project.analytics_153293282",
        "question": "Can you group users by the week they first used the app, starting from July 9, 2018? I'd like to see the retention rate for each group over the next two weeks.",
        "external_knowledge": "retention_rate.md"
    },
    {
        "instance_id": "ga028",
        "db": "firebase-public-project.analytics_153293282",
        "question": "Using the 7-day retention calculation method, find the number of users who first used the app in the week starting on \"2018-07-02\" and tell me the number of retained users for each week from 0 to 4 weeks.",
        "external_knowledge": "retention_rate.md"
    },
    {
        "instance_id": "ga020",
        "db": "firebase-public-project.analytics_153293282",
        "question": "Which quickplay event type had the lowest user retention rate during the second week after their initial engagement, for users who first engaged between August 1 and August 15, 2018?",
        "external_knowledge": "retention_rate.md"
    },
    {
        "instance_id": "ga020_1",
        "db": "firebase-public-project.analytics_153293282",
        "question": "What is the retention rate for users two weeks after their initial quickplay event within the period from July 2, 2018, to July 16, 2018, calculated separately for each quickplay event type?",
        "external_knowledge": "retention_rate.md"
    },
    {
        "instance_id": "ga025",
        "db": "firebase-public-project.analytics_153293282",
        "question": "For all users who first opened the app in September 2018 and then uninstalled within seven days, I want to know what percentage of them experienced an app crash.",
        "external_knowledge": null
    }
]